index.html
<!doctype html>
<html lang="en">
<head>
<title>Severin Gsponer</title>
<!-- 2016-10-04 Tue 14:42 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Severin Gsponer">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Severin Gsponer</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Contact</h2>
<div class="outline-text-2" id="text-1">
<p>
Severin Gsponer<br >
severin.gsponer@insight-centre.org
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Viva</h2>
<div class="outline-text-2" id="text-2">
<p>
Since 2015 Severin Gsponer is a PhD student at the Insight Centre for Data Analytics at the University College Dublin, Ireland. He holds a MSc(2014) and a BSc(2012) in Computer Science from the University of Basel, Switzerland. 
His main research interest is machine learning and optimization. His current project focuses on analyzing different loss functions and convex optimization strategies, on a range of sequence data with different characteristics (i.e. length, alphabet size, motif length). Thereby, he’s especially interested in the scalability, accuracy and interpretability of the produced models. To achieve this goal in a structured and reproducible way, he is developing a simulation framework. Additionally, he is extending the current classification framework to work on sequence regression problems.
Severin Gsponer is also interested in a variety of other Computer Science related topics like: recurrent neural networks, feature selection, feature learning, multitask learning, bioinformatics, repoducibility in research and exascale computing.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Research Interests</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Machine learning
</li>
<li>Optimization
</li>
<li>Bioinformatics
</li>
<li>Recurrent neural networks
</li>
<li>Reproducibility in research
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Teaching</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Teaching assistant / Tutor</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Object-Oriented Programming (COMP30070) WS 2016
</li>
<li>Software Engineering (COMP30670) SS 2016
</li>
<li>Computer Programming I (COMP10110) WS 2015
</li>
<li>Introduction to Java (COMP20250) WS 2015
</li>
<li>Programming I (Python) (COMP10280) WS 2015
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Publications</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Smart Pointers</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Podcasts</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1">English podcasts</h4>
<div class="outline-text-4" id="text-6-1-1">
<ul class="org-ul">
<li><b>Linear Digressions</b> - Regular podcast by Ben Jaffe and Katie Malone about various topics in Machine learning (<a href="http://lineardigressions.com/">http://lineardigressions.com/</a>)
</li>
<li><b>Data Sceptic</b> - Podcast about Kyle and Linh Da features longer interviews with active data scientists as well as episodes that introduces basic principles of Data Science (<a href="http://dataskeptic.com/">http://dataskeptic.com/</a>)
</li>
<li><b>Talking Machines</b> - Katherine Gorman and Ryan Adam talk about topics in Machine learning and present interesting interviews with researches and experts in the field. (<a href="http://www.thetalkingmachines.com/about">http://www.thetalkingmachines.com/about</a>)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2">German podcasts</h4>
<div class="outline-text-4" id="text-6-1-2">
<ul class="org-ul">
<li><b>Methodisch inkorrekt</b> - Nicolas Wöhrl and Reinhard Remfort present forth nightly four papers from fields of science in a entertaining and informative way
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Newsletters</h3>
<div class="outline-text-3" id="text-6-2">
<p>
These newsletter provide a good overview over the mass of article and news in the field of ML and AI:
</p>
<ul class="org-ul">
<li><b>ML Weekly</b> - Gathering of ML related Twitter, Facebook, Google+, and LinkedIn posts. (<a href="http://scottge.net/tag/machine-learning-weekly/">http://scottge.net/tag/machine-learning-weekly/</a>)
</li>
<li><b>AI Weekly</b> - Similar to ML Weekly but for the field of AI. (<a href="http://aiweekly.co/">http://aiweekly.co/</a>)
</li>
<li><b>Data Elixir</b> - Curated news and resources about data science (<a href="http://dataelixir.com/">http://dataelixir.com/</a>)
</li>
<li><b>Import AI</b> - A newsletter about artificial intelligence (<a href="http://aiweekly.co/">http://aiweekly.co/</a>)
</li>
</ul>

<p>
I follow these mailing lists to keep get recent announcements and CfP. They are more oriented at researchers and people working in academia.
</p>
<ul class="org-ul">
<li><b>Connectionists</b> - Mailing list for discussion about neural networks and cognitive or computational neuroscience (<a href="https://mailman.srv.cs.cmu.edu/mailman/listinfo/connectionists">https://mailman.srv.cs.cmu.edu/mailman/listinfo/connectionists</a>) 
</li>
<li><b>ML-News</b> - Google group for announcements and CfP for the machine learning community (<a href="https://groups.google.com/forum/#!forum/ml-news">https://groups.google.com/forum/#!forum/ml-news</a>)
</li>
<li><b>UAI</b> - Mailing list for uncertainty in artificial intelligence (<a href="https://secure.engr.oregonstate.edu/mailman/listinfo/uai">https://secure.engr.oregonstate.edu/mailman/listinfo/uai</a>)
</li>
</ul>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">Contact</a></li>
<li><a href="#sec-2">Viva</a></li>
<li><a href="#sec-3">Research Interests</a></li>
<li><a href="#sec-4">Teaching</a>
<ul class="nav">
<li><a href="#sec-4-1">Teaching assistant / Tutor</a></li>
</ul>
</li>
<li><a href="#sec-5">Publications</a></li>
<li><a href="#sec-6">Smart Pointers</a>
<ul class="nav">
<li><a href="#sec-6-1">Podcasts</a></li>
<li><a href="#sec-6-2">Newsletters</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Severin Gsponer</p>
<p class="date">Created: 2016-10-04 Tue 14:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
